#define _CRT_SECURE_NO_WARNINGS 1
#include	<stdio.h>
#include	<Windows.h>

int main()
{
	/*int i = -20;
	unsigned int j = 10;
	printf("%d\n", i + j);*/
	//按照补码形式进行运算，最后格式化成有符号整数
	//10000000	00000000	00000000	00010100
	//11111111	11111111	11111111	11101011
	//11111111	11111111	11111111	11101100-补码
	//00000000	00000000	00000000	00001010-补码
	//11111111	11111111	11111111	11110110-结果
	//11111111	11111111	11111111	11110101-反码
	//10000000	00000000	00000000	00001010-结果原码 -10 
	

	//unsigned int i;				//	死循环
	//for ( i = 9; i >= 0; i--)
	//{
	//	printf("%u\n", i);
	//	Sleep(100);
	//}

	//char a[1000];					//	/0的ASCII码值是0，所以在0的时候停止
	//int i;
	//for ( i = 0; i < 1000; i++)
	//{
	//	a[i] = -1 - i;
	//}
	//printf("%d\n", strlen(a));

	//unsigned char i = 0;				//unsigned	char 值范围是0-255，超出从0循环所以死循环 
	//for ( i = 0; i <=255; i++)
	//{
	//	printf("hello world\n");
	//}
	//return 0;
	

	/*9.0
	1001.0
	(-1)^0*1.001*2^3
	(-1)^s *	M  * 2^E	
	s	-0
	M	-1.001
	E	-3	*/
	//int n = 9;
	//float* p = (float*)&n;
	//printf("n 的值是:%d\n", *p);			//9
	//printf("*p的值为：%f\n", *p);			//0.000000

	//*p = 9.0;
	// 1001.0
	// 1.001*2^3
	// （-1）^0* 1.001*2^3
	// 0 10000010	0010000000000000000000	-内存存储
	//printf("n传值后 的值是:%d\n", n);		//1081567616
	//printf("*p的值为：%f\n", *p);			//9.000000	

	float f = 5.5;
	/*5.5		存入内存
	101.1——二进制
	(-1)^0 * 1.011 * 2^2
	S=0
	M=1.011
	E=2	+127
	0	10000001	0110000000000000000000
	0100 0000 1011 0000 0000 0000 0000 0000
	0x40b0000*/

}